IDEA Open Model
ReinfBarInclined Properties
Compatible with IDEA StatiCa Beta 20.0
The ReinfBarInclined type exposes the following members.
Properties
Name | Description
AddBarOnBottom
 Add bar on Bottom - possible only for FullLength
AddBarOnTop
 Add bar on top - possible only for FullLength
Angle
 Angle between bar and master edge
BottomLength
 Length of additional bar on the bottom
Cover
 Cover of reinforcement
 (Inherited from ReinforcementGroup.)
CoverFromSetting
 Use cover from DetailModelSetting
 (Inherited from ReinforcementGroup.)
Diameter
 Diameter o reinforcement
 (Inherited from ReinforcementGroup.)
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
 (Inherited from ReinforcementGroup.)
EndsTypeBeg
 End type of the beginning of reinforcement bar
 (Inherited from ReinforcementGroup.)
EndsTypeEnd
 End type of the end of reinforcement bar
 (Inherited from ReinforcementGroup.)
Id
 Element Id
 (Inherited from OpenElementId.)
InclinedReinfBarType
 Type of inclined reinf bar
MasterComponent
 Master component of reinforcement
MasterEdge
 Master edge of reinforcement - edge from which is measured angle
MasterPoint
 Master point of reinforcement
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
 (Inherited from ReinforcementGroup.)
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
TopLength
 Length of additional bar on the top
Top
See Also
Reference
ReinfBarInclined Class
IdeaRS.OpenModel.Detail Namespace